[
  {
    "Content": "Just finished a fantastic hiking trip in the mountains! Nature is truly refreshing.",
    "CreatedAt": "2025-02-24T08:30:00",
    "CreatorId": 1
  },
  {
    "Content": "Spent the weekend painting landscapes. Art is my therapy!",
    "CreatedAt": "2025-02-23T14:15:00",
    "CreatorId": 2
  },
  {
    "Content": "Spent the weekend painting landscapes. Art is my therapy!",
    "CreatedAt": "2025-02-23T14:15:00",
    "CreatorId": 2
  },
  {
    "Content": "Had an intense chess match today. Strategy and patience are key!",
    "CreatedAt": "2025-02-22T19:45:00",
    "CreatorId": 3
  },
  {
    "Content": "Baking is my passion! Tried a new chocolate cake recipe, and it turned out amazing!",
    "CreatedAt": "2025-02-21T11:20:00",
    "CreatorId": 4
  },
  {
    "Content": "Just finished reading a thrilling mystery novel. Books are my escape from reality.",
    "CreatedAt": "2025-02-20T17:10:00",
    "CreatorId": 5
  },
  {
    "Content": "Another great day at the gym! Fitness is not a destination; it’s a way of life.",
    "CreatedAt": "2025-02-19T09:00:00",
    "CreatorId": 6
  },
  {
    "Content": "Practicing guitar has been so rewarding. Music is the soul’s language!",
    "CreatedAt": "2025-02-18T16:40:00",
    "CreatorId": 7
  },
  {
    "Content": "Photography is my passion! Captured some breathtaking sunset shots today.",
    "CreatedAt": "2025-02-17T18:30:00",
    "CreatorId": 8
  },
  {
    "Content": "Tried gardening today and planted some fresh herbs. Can’t wait to see them grow!",
    "CreatedAt": "2025-02-16T07:45:00",
    "CreatorId": 9
  },
  {
    "Content": "Hi",
    "CreatedAt": "2025-02-25T12:00:00",
    "CreatorId": 3
  },
  {
    "Content": "Exciting news! I just got promoted at work! Hard work truly pays off.",
    "CreatedAt": "2025-03-01T10:00:00",
    "CreatorId": 1
  },
  {
    "Content": "Just finished my first marathon! It was an incredible experience and a huge milestone for me.",
    "CreatedAt": "2025-03-02T12:30:00",
    "CreatorId": 2
  },
  {
    "Content": "Finally published my first book! A dream come true after years of dedication.",
    "CreatedAt": "2025-03-03T09:45:00",
    "CreatorId": 3
  },
  {
    "Content": "I'm officially engaged! Feeling over the moon and can't wait for this new journey ahead.",
    "CreatedAt": "2025-03-04T15:20:00",
    "CreatorId": 4
  },
  {
    "Content": "I just adopted a puppy! Meet my new best friend, Max.",
    "CreatedAt": "2025-03-05T11:10:00",
    "CreatorId": 5
  },
  {
    "Content": "Graduated with my master’s degree today! Hard work and perseverance made this possible.",
    "CreatedAt": "2025-03-06T16:00:00",
    "CreatorId": 6
  },
  {
    "Content": "We bought our first house! Finally moving into our dream home.",
    "CreatedAt": "2025-03-07T14:45:00",
    "CreatorId": 7
  },
  {
    "Content": "Just landed my dream job! I’m beyond excited to start this new chapter.",
    "CreatedAt": "2025-03-08T09:30:00",
    "CreatorId": 8
  },
  {
    "Content": "Celebrating 10 years of marriage today! Feeling grateful for the journey.",
    "CreatedAt": "2025-03-09T18:20:00",
    "CreatorId": 9
  },
  {
    "Content": "This is a very long post that exceeds the allowed character limit. It is being added to demonstrate validation failure due to excessive content. The maximum allowed length is 300 characters, but this post contains more than that, making it invalid for import. It should trigger an error message and be skipped.",
    "CreatedAt": "2025-03-10T20:00:00",
    "CreatorId": 3
  },
  {
    "Content": "Climate change is an urgent issue. We must act now to protect our planet.",
    "CreatedAt": "2025-04-01T12:00:00",
    "CreatorId": 5
  },
  {
    "Content": "Access to clean drinking water should be a fundamental right, not a privilege.",
    "CreatedAt": "2025-04-02T14:30:00",
    "CreatorId": 3
  },
  {
    "Content": "The rising cost of healthcare is leaving many families behind. We need reforms!",
    "CreatedAt": "2025-04-03T09:15:00",
    "CreatorId": 7
  },
  {
    "Content": "Deforestation is destroying our rainforests. Time to take a stand for nature!",
    "CreatedAt": "2025-04-04T18:45:00",
    "CreatorId": 9
  },
  {
    "Content": "Plastic pollution in the oceans is a disaster. We need better waste management.",
    "CreatedAt": "2025-04-05T16:20:00",
    "CreatorId": 1
  },
  {
    "Content": "Racism and inequality still persist. It’s time to take real action!",
    "CreatedAt": "2025-04-06T11:00:00",
    "CreatorId": 8
  },
  {
    "Content": "The world should focus more on mental health awareness and support.",
    "CreatedAt": "2025-04-07T08:30:00",
    "CreatorId": 2
  },
  {
    "Content": "Child labor is still a major issue worldwide. We need stronger laws!",
    "CreatedAt": "2025-04-08T20:00:00",
    "CreatorId": 6
  },
  {
    "Content": "Hunger and poverty affect millions daily. Let’s make a difference!",
    "CreatedAt": "2025-04-09T15:10:00",
    "CreatorId": 4
  },
  {
    "Content": "This post will fail validation because it lacks a CreatedAt property.",
    "CreatorId": 3
  },
  {
    "Content": "This post has an incorrect date format and should not be processed.",
    "CreatedAt": "04-10-2025 13:45",
    "CreatorId": 2
  },
  {
    "Content": "This post is missing a CreatorId and should fail validation.",
    "CreatedAt": "2025-04-11T10:30:00"
  },
  {
    "Content": "This post has an invalid CreatorId that does not exist in the database.",
    "CreatedAt": "2025-04-12T17:00:00",
    "CreatorId": 999
  }
]
